tap "bats-core/bats-core"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"

brew "aws-cdk"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bats-assert"   # depends on bats-core tap
brew "bats-core"
brew "bats-support"  # depends on bats-core tap
brew "cheat"
brew "choose-rust"
brew "cloudflared"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "dateutils"
brew "displayplacer", args: ["HEAD"]
brew "dtrx"
brew "duf"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "findutils"
brew "fortune"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "graphicsmagick"
brew "grep"
brew "hashicorp/tap/terraform"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "ipcalc"
brew "ipython"
brew "lesspipe"
brew "libfido2"
brew "lolcat"
brew "magic-wormhole"
brew "miller"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "nyancat"
brew "pastel"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "protobuf"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "sl"
brew "switchaudio-osx"
brew "tailscale"  # note: might want to use app store / pkg install instead
brew "tesseract"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "ykman"
brew "yq"
brew "zstd"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "blackhole-2ch"
cask "datagrip"
cask "docker-desktop"
cask "domzilla-caffeine"
cask "easy-move+resize"
cask "firefox"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "iina"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "lunar"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "tandem"
cask "utm"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zoom"
