tap "homebrew/bundle"
tap "homebrew/command-not-found"

brew "bash"
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "cowsay"
brew "displayplacer", args: ["HEAD"]
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "findutils"
brew "fortune"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "htop"
brew "hyperfine"
brew "lolcat"
brew "miller"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "nyancat"
brew "pastel"
brew "pipx"
brew "pwgen"
brew "ripgrep"
brew "shellcheck"
brew "sl"
brew "switchaudio-osx"
brew "tmux"
brew "trash"
brew "tree"
brew "uv"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zstd"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "docker"
cask "easy-move+resize"
cask "firefox"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "karabiner-elements"
cask "kitty"
cask "lunar"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tandem"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zoom"
